package com.Advance.Collection.Set;

// Set集合概述
public class statement {
    /*
        Set集合是由一串无序的，不能重复的相同类型元素构成的集合。
        下图是一个班级的Set集合。这个Set集合中有一些学生，这些学生是无序的，
        不能通过类似于List集合的序号访问，而且不能有重复的同学。
        +--------------+
        |     Set      |
        +--------------+
        |   张三        |
        |       李四    |
        |   王五        |
        |       老六    |
        +--------------+

        提示：List集合中的元素是有序的、可重复的，而 Set集合中的元素是无序的、不能重复的。
            List集合强调的是有序，Set集合强调的是不重复。
            当不考虑顺序，且没有重复元素时，Set集合和 List集合可以互相替换的。
        Set接口直接实现类主要是HashSet，HashSet是基于散列表数据结构的实现。
    */
}
