package com.Advance.Collection.List;

// List集合概述
public class statement {
    /*
        List集合中的元素是有序的，可以重复出现。下表是一个班级集合数组，
        这个集合中有一些学生，这些学生是有序的，顺序是他们被放到集合中的顺序，
        可以通过序号访问他们。这就像老师给进入班级的人分配学号，
        第一个报到的是“张三”，老师给他分配的是0，第二个报到的是“李四”，老师给他分配的是1，
        以此类推，最后一个序号应该是“学生人数-1”。
        +----+---------+
        |序号 |   元素   |
        +----+---------+
        | 0  |   张三   |
        +----+---------+
        | 1  |   李四   |
        +----+---------+
        | 2  |   王五   |
        +----+---------+
        | 3  |   老六   |
        +----+---------+
        | 4  |   张三   |
        +----+---------+

        提示 List集合关心的元素是否有序，而不关心是否重复，请记住这个原则。

        List接口的实现类有：ArrayList 和 LinkedList。ArrayList是基于动态数组数据结构的实现，
        LinkedList是基于链表数据结构的实现。
        ArrayList访问元素速度优于LinkedList，
        LinkedList占用的内存空间比较大，但LinkedList在批量插入或删除数据时优于ArrayList。

        不同的结构对应于不同的算法，有的考虑节省占用空间，有的考虑提高运行效率，
        提高运行速度往往是以牺牲空间为代价的，而节省占用空间往往是以牺牲运行速度为代价的。
    */
}
